{
  "main": {
    "name":"Emre Cosar",
    "occupation":"Software Engineer",
    "description":"",
    "image":"profile-picture.jpg",
    "bio": "Interests in creating software solutions. Hands-on experience about Microservices, Cloud environments and DevOps. Started as full-stack web engineer, mobile(Android and iOS ) engineer and now developing himself as Software Engineerin Lead. Strong and eager about Java, JavaScript and Terraform. Clean coder, open-source committer and enjoys fork&try projects! Loves to build software solutions that makes a difference and/or add value. To achieve that, especially pays attention to code quality and to the process (whether the right tools and frameworks are used in the project for optimal result). Has strong communication skills and he is goal oriented.",
    "joy": "Music is everything!",
    "email": "emrecosarr@gmail.com",
    "address":{
      "city":"Amsterdam"
    },
    "resumedownload":"/pdf/EmreCosar.pdf",
    "social":[
      {
        "name":"github",
        "url":"//github.com/emrecosar",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"//www.linkedin.com/in/emrecosar/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"twitter",
        "url":"//twitter.com/cosaremre",
        "className":"fa fa-twitter"
      },
      {
        "name":"instagram",
        "url":"//instagram.com/emrecosar",
        "className":"fa fa-instagram"
      },
      {
        "name":"facebook",
        "url":"//facebook.com/emrecosar",
        "className":"fa fa-facebook"
      }
    ]
  },
  "resume":{
    "work":[
      {
        "company":"Elsevier",
        "location":"Amsterdam",
        "title":"Software Engineering Lead",
        "years":"February 2022 - Present",
        "description":"As a software engineering lead in Funding Domain, responsible from an agile development team. The team process big data, transform and normalise it to the end-user and then showcase other Elsevier products like Scopus, Scival, Pure and etc. Responsible for product delivery, technical skillset, personal development and vision to improve and lead the team and product."
      },
      {
        "company":"Elsevier",
        "location":"Amsterdam",
        "title":"Senior Software Engineer",
        "years":"November 2018 - February 2022",
        "description":"As a backend developer, creating software solutions rely on microservice architecture mostly using Java, React with CI/CD pipelines running on AWS cloud environment with Terraform managed resources. Working with self-managable teams and creating DevOps culture. Excellent communication withing teams in and outside of the company."
      },
      {
        "company":"Yapi Kredi Technology",
        "location":"Istanbul",
        "title":"Senior Software Engineer",
        "years":"December 2016 - November 2018",
        "description":"Worked on mobile banking application both native Android and iOS clients, has eye-verify login option first in banking apps, and APIs. Then created micro services architectures with Spring Boot and Spring Cloud for core banking domains. Using TDD approach and cloud contract tests. Sticks with clean code principles."
      },
      {
        "company":"Garanti Technology",
        "location":"Istanbul",
        "title":"Senior Software Engineer",
        "years":"July 2012 - December 2016",
        "description":"As a full stack developer inside Web Technologies & Social Media Applications Department, maintained bank's public site and made a mobile version of it. Created Twitter and Facebook web applications that bank's customers use and enrolled campaigns over Facebook and twitter. Also was a part of team that created iGaranti(now as GarantiOne) web, facebook and mobile applications. Developed notification based Google Glass application, first in Turkey, for iGaranti mobile application. Created new products and platforms for our customers to touch in so many ways. In every aspects of application development processes; designing the architecture, creating web and backend level."
      },
      {
        "company":"NETZ Sp. o.o.",
        "location":"Gdansk",
        "title":"Software Engineer Intern",
        "years":"July 2011 - October 2011",
        "description":"As an intern in Gdansk/Poland for 3 months, worked at CRM based company, Netz. First business experience was about java based desktop applications and three different Android applications about viewing CRM document and tracking customer-cargo locations."
      }
    ],
    "education":[
      {
        "school":"Ege University",
        "degree":"Bachelor's in Computer Engineering",
        "graduated":"June 2012",
        "description":"Bachelor's thesis is ontology based issue tracking systems integration. Common and general ontology is designed and modelled for understanding different issue tracking systems and running in between. Also common tools and algorithms will be used for inferencing and generating graphical visualisation."
      }
    ]
  }
}
