{
  "main": {
    "name":"Emre Cosar",
    "occupation":"Senior Software Developer",
    "description":"5+ years experience about software development with interest in many aspects of building software.",
    "image":"profile-picture.png",
    "bio": "5+ experience about software development with interest in many aspects of building software. Senior Software Engineer in Yapı Kredi Technology. Currently, working about micro-service architectures with React, Spring Boot and Spring Cloud using the TDD approach and CI/CD. Formerly full stack web and mobile(Android / iOS and backend) engineer. Strong and eager about Java and JavaScript. Clean coder and open-source committer! Loves to build software solutions that makes a difference and/or add value. To achieve that, especially pays attention to code quality and to the process (whether the right tools and frameworks are used in the project for optimal result). Has strong communication skills and he is goal oriented.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "emrecosarr@gmail.com",
    "phone": "+90 505 739 7695",
    "address":{
      "city":"Istanbul",
      "zip": "34752"
    },
    "website": "http://www.emrecosar.com",
    "resumedownload":"pdf/EmreCosar.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/emrecosar/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/emrecosar",
        "className":"fa fa-github"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com/cosaremre",
        "className":"fa fa-twitter"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/emrecosar",
        "className":"fa fa-instagram"
      },
      {
        "name":"google-plus",
        "url":"https://plus.google.com/+EmreCosar",
        "className":"fa fa-google-plus"
      },
      {
        "name":"facebook",
        "url":"http://facebook.com/emrecosar",
        "className":"fa fa-facebook"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Ege University",
        "degree":"Bachelor's in Computer Engineering",
        "graduated":"June 2012",
        "description":"Bachelor's Thesis is Ontology based issue tracking systems entegration. Common and general ontology will be designed and modelled for understanding different issue tracking systems and running in between. Also common tools and algorithms will be used for inferencing and generating graphical visualisation."
      }
    ],
    "work":[
      {
        "company":"Yapi Kredi Technology",
        "title":"Senior Software Engineer",
        "years":"December 2016 - Present",
        "description":"As a Senior Software Engineer, developing new technologies and frameworks for FinTech Ecosystem. Currently working on micro services architectures with Spring Boot and Spring Cloud. Using TDD approach for unit/integration and cloud tests. Sticks with clean code principles."
      },
      {
        "company":"Garanti Technology - BBVA Group",
        "title":"Senior Software Engineer",
        "years":"July 2012 - December 2016",
        "description":"As a Senior Software Engineer, worked as a part of Web Technologies & Social Media Applications Department. Maintained www.garanti.com.tr public site and made a mobile version of it. Created Twitter and Facebook web applications that bank's customers use and enrolled campaigns over Facebook and twitter. Also he was a part of team that created iGaranti web and mobile applications. Developed Google Glass application for iGaranti mobile application. Created new products and platforms for our customers to touch in so many ways. In every level of application development process; designing the architecture, creating web and backend level."
      },
      {
        "company":"Netz",
        "title":"Software Engineer Intern",
        "years":"July 2011 - September 2011",
        "description":"Worked as an intern at Netz in Poland and 3 month working with CRM based company, NETZ. My first business experience was about java based desktop applications and three different Android applications about viewing CRM document and tracking customer-cargo locations."
      }
    ]
  }
}
